In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [31]:
df=pd.read_csv('statesdata1.csv')
df.head()

         Date   State  Confirmed  Recovered  Deceased  Other  Tested
0  2020-01-30  Kerala          1          0         0      0     NaN
1  2020-01-30   India          1          0         0      0     NaN
2  2020-02-02  Kerala          2          0         0      0     NaN
3  2020-02-02   India          2          0         0      0     NaN
4  2020-02-03  Kerala          3          0         0      0     NaN

In [32]:
df.tail()

,Date,State,Confirmed,Recovered,Deceased,Other,Tested
18118,2021-07-27,Tripura,76536,72069,741,63,1505556.0
18119,2021-07-27,India,31446028,30617286,421511,12435,459164121.0
18120,2021-07-27,Uttar Pradesh,1708208,1684601,22750,0,64277972.0
18121,2021-07-27,Uttarakhand,341778,327766,7359,6015,6164559.0
18122,2021-07-27,West Bengal,1524296,1494645,18085,0,15510885.0

In [47]:
statelist=df['State'].unique()

### The above data set is in a cumulative form we have convert it to the usual form

In [51]:
newdf=pd.DataFrame()

In [58]:
test=df.groupby('State').get_group('India')

In [59]:
test.tail()

            Date  State  Confirmed  Recovered  Deceased  Other       Tested
17971 2021-07-23  India   31331207   30495458    420044  12409  454570811.0
18008 2021-07-24  India   31371493   30535496    420585  12415  456289567.0
18045 2021-07-25  India   31409672   30571441    420996  12424  457444011.0
18082 2021-07-26  India   31440492   30613944    421414  12435  459164121.0
18119 2021-07-27  India   31446028   30617286    421511  12435  459164121.0

In [60]:
test=test.set_index(['Date'])
test.head(2)

            State  Confirmed  Recovered  Deceased  Other  Tested
Date
2020-01-30  India          1          0         0      0     NaN
2020-02-02  India          2          0         0      0     NaN

In [61]:
test.drop('State',axis=1,inplace=True)
test.tail()

            Confirmed  Recovered  Deceased  Other       Tested
Date
2021-07-23   31331207   30495458    420044  12409  454570811.0
2021-07-24   31371493   30535496    420585  12415  456289567.0
2021-07-25   31409672   30571441    420996  12424  457444011.0
2021-07-26   31440492   30613944    421414  12435  459164121.0
2021-07-27   31446028   30617286    421511  12435  459164121.0

In [63]:
test=test.diff(axis=0,periods=1)
test.tail()

            Confirmed  Recovered  Deceased  Other     Tested
Date
2021-07-23    39501.0    35144.0     542.0    0.0  1631266.0
2021-07-24    40286.0    40038.0     541.0    6.0  1718756.0
2021-07-25    38179.0    35945.0     411.0    9.0  1154444.0
2021-07-26    30820.0    42503.0     418.0   11.0  1720110.0
2021-07-27     5536.0     3342.0      97.0    0.0        0.0

In [64]:
test['State']='India'
test.tail()

            Confirmed  Recovered  Deceased  Other     Tested  State
Date
2021-07-23    39501.0    35144.0     542.0    0.0  1631266.0  India
2021-07-24    40286.0    40038.0     541.0    6.0  1718756.0  India
2021-07-25    38179.0    35945.0     411.0    9.0  1154444.0  India
2021-07-26    30820.0    42503.0     418.0   11.0  1720110.0  India
2021-07-27     5536.0     3342.0      97.0    0.0        0.0  India

In [65]:
test.reset_index()

          Date  Confirmed  Recovered  Deceased  Other     Tested  State
0   2020-01-30        NaN        NaN       NaN    NaN        NaN  India
1   2020-02-02        1.0        0.0       0.0    0.0        NaN  India
2   2020-02-03        1.0        0.0       0.0    0.0        NaN  India
3   2020-02-14        0.0        3.0       0.0    0.0        NaN  India
4   2020-03-02        2.0        0.0       0.0    0.0        NaN  India
..         ...        ...        ...       ...    ...        ...    ...
512 2021-07-23    39501.0    35144.0     542.0    0.0  1631266.0  India
513 2021-07-24    40286.0    40038.0     541.0    6.0  1718756.0  India
514 2021-07-25    38179.0    35945.0     411.0    9.0  1154444.0  India
515 2021-07-26    30820.0    42503.0     418.0   11.0  1720110.0  India
516 2021-07-27     5536.0     3342.0      97.0    0.0        0.0  India

[517 rows x 7 columns]

In [69]:
newdf.append(test, ignore_index = True)

     Confirmed  Recovered  Deceased  Other     Tested  State
0          NaN        NaN       NaN    NaN        NaN  India
1          1.0        0.0       0.0    0.0        NaN  India
2          1.0        0.0       0.0    0.0        NaN  India
3          0.0        3.0       0.0    0.0        NaN  India
4          2.0        0.0       0.0    0.0        NaN  India
..         ...        ...       ...    ...        ...    ...
512    39501.0    35144.0     542.0    0.0  1631266.0  India
513    40286.0    40038.0     541.0    6.0  1718756.0  India
514    38179.0    35945.0     411.0    9.0  1154444.0  India
515    30820.0    42503.0     418.0   11.0  1720110.0  India
516     5536.0     3342.0      97.0    0.0        0.0  India

[517 rows x 6 columns]

In [93]:
c=df.columns

In [94]:
ndf = pd.DataFrame(columns=c)

In [72]:
ndf=pd.DataFrame()

In [98]:
for state in statelist:
    dftest=df.groupby('State').get_group(state)
    
    dftest=dftest.set_index(['Date'])
    
    dftest.drop('State',axis=1,inplace=True)
    
    dftest=dftest.diff(axis=0,periods=1)
    
    dftest['State']=state
    
    
    
    dftest.reset_index(inplace=True)
    
   # display(dftest.tail())
    
    #ndf.append(dftest,ignore_index = True)
    ndf=pd.concat([ndf,dftest])

In [99]:
ndf.tail()

          Date        State  Confirmed  Recovered  Deceased  Other  Tested
186 2021-07-23  Lakshadweep       10.0        7.0       0.0    0.0   958.0
187 2021-07-24  Lakshadweep       17.0        6.0       0.0    0.0  1011.0
188 2021-07-25  Lakshadweep        2.0        7.0       0.0    0.0   258.0
189 2021-07-26  Lakshadweep       12.0        6.0       0.0    0.0  1306.0
190 2021-07-27  Lakshadweep        0.0        0.0       0.0    0.0     0.0

In [100]:
df.shape

(18123, 7)

In [102]:
ndf.shape

(18123, 7)